stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_ll_bus.h
/**
  * @brief  Disable APB1 GRP1 peripherals clock.
  * @rmtoll APBENR1     TIM2EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     TIM3EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     TIM6EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     TIM7EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     LPUART2EN      LL_APB1_GRP1_DisableClock\n
  *         APBENR1     LCDEN          LL_APB1_GRP1_DisableClock\n
  *         APBENR1     RTCAPBEN       LL_APB1_GRP1_DisableClock\n
  *         APBENR1     WWDGEN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     LPUART3EN      LL_APB1_GRP1_DisableClock\n
  *         APBENR1     USBFSEN        LL_APB1_GRP1_DisableClock\n
  *         APBENR1     SPI2EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     SPI3EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     CRSEN          LL_APB1_GRP1_DisableClock\n
  *         APBENR1     USART2EN       LL_APB1_GRP1_DisableClock\n
  *         APBENR1     USART3EN       LL_APB1_GRP1_DisableClock\n
  *         APBENR1     USART4EN       LL_APB1_GRP1_DisableClock\n
  *         APBENR1     LPUART1EN      LL_APB1_GRP1_DisableClock\n
  *         APBENR1     I2C1EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     I2C2EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     I2C3EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     OPAMPEN        LL_APB1_GRP1_DisableClock\n
  *         APBENR1     I2C4EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     LPTIM3EN       LL_APB1_GRP1_DisableClock\n
  *         APBENR1     PWREN          LL_APB1_GRP1_DisableClock\n
  *         APBENR1     DAC1EN         LL_APB1_GRP1_DisableClock\n
  *         APBENR1     LPTIM2EN       LL_APB1_GRP1_DisableClock\n
  *         APBENR1     LPTIM1EN       LL_APB1_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LCD
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC1
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBENR1, Periphs);
}

/**
  * @brief  Force APB1 GRP1 peripherals reset.
  * @rmtoll APBRSTR1    TIM2RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    TIM3RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    TIM6RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    TIM7RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    LPUART2RST     LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    LCDRST         LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    RTCAPBRST      LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    WWDGRST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    LPUART3RST     LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    USBFSRST       LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    SPI2RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    SPI3RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    CRSRST         LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    USART2RST      LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    USART3RST      LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    USART4RST      LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    LPUART1RST     LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    I2C1RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    I2C2RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    I2C3RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    OPAMPRST       LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    I2C4RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    LPTIM3RST      LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    PWRRST         LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    DAC1RST        LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    LPTIM2RST      LL_APB1_GRP1_ForceReset\n
  *         APBRSTR1    LPTIM1RST      LL_APB1_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LCD
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC1
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APBRSTR1, Periphs);
}

/**
  * @brief  Release APB1 GRP1 peripherals reset.
  * @rmtoll APBRSTR1    TIM2RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    TIM3RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    TIM6RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    TIM7RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    LPUART2RST     LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    LCDRST         LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    RTCAPBRST      LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    WWDGRST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    LPUART3RST     LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    USBFSRST       LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    SPI2RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    SPI3RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    CRSRST         LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    USART2RST      LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    USART3RST      LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    USART4RST      LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    LPUART1RST     LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    I2C1RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    I2C2RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    I2C3RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    OPAMPRST       LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    I2C4RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    LPTIM3RST      LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    PWRRST         LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    DAC1RST        LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    LPTIM2RST      LL_APB1_GRP1_ReleaseReset\n
  *         APBRSTR1    LPTIM1RST      LL_APB1_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LCD
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC1
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBRSTR1, Periphs);
}

/**
  * @brief  Enable APB1 GRP1 peripheral clocks in Sleep and Stop modes
  * @rmtoll APBSMENR1   TIM2SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   TIM3SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   TIM6SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   TIM7SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   LPUART2SMEN    LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   LCDSMEN        LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   RTCAPBSMEN     LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   WWDGSMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   LPUART3SMEN    LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   USBFSSMEN      LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   SPI2SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   SPI3SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   CRSSMEN        LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   USART2SMEN     LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   USART3SMEN     LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   USART4SMEN     LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   LPUART1SMEN    LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   I2C1SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   I2C2SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   I2C3SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   OPAMPSMEN      LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   I2C4SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   LPTIM3SMEN     LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   PWRSMEN        LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   DAC1SMEN       LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   LPTIM2SMEN     LL_APB1_GRP1_EnableClockStopSleep\n
  *         APBSMENR1   LPTIM1SMEN     LL_APB1_GRP1_EnableClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LCD
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC1
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockStopSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APBSMENR1, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APBSMENR1, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB_1 peripheral clocks in Sleep and Stop modes
  * @rmtoll APBSMENR1   TIM2SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   TIM3SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   TIM6SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   TIM7SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   LPUART2SMEN   LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   LCDSMEN       LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   RTCAPBSMEN    LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   WWDGSMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   LPUART3SMEN   LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   USBFSSMEN     LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   SPI2SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   SPI3SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   CRSSMEN       LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   USART2SMEN    LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   USART3SMEN    LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   USART4SMEN    LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   LPUART1SMEN   LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   I2C1SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   I2C2SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   I2C3SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   OPAMPSMEN     LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   I2C4SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   LPTIM3SMEN    LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   PWRSMEN       LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   DAC1SMEN      LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   LPTIM2SMEN    LL_APB1_GRP1_DisableClockStopSleep\n
  *         APBSMENR1   LPTIM1SMEN    LL_APB1_GRP1_DisableClockStopSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LCD
  *         @arg @ref LL_APB1_GRP1_PERIPH_RTCAPB
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C4
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC1
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockStopSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBSMENR1, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1_GRP2 GRP2
  * @{
  */

/**
  * @brief  Enable APB1 GRP2 peripherals clock.
  * @rmtoll APBENR2      SYSCFGEN      LL_APB1_GRP2_EnableClock\n
  *         APBENR2      TIM1EN        LL_APB1_GRP2_EnableClock\n
  *         APBENR2      SPI1EN        LL_APB1_GRP2_EnableClock\n
  *         APBENR2      USART1EN      LL_APB1_GRP2_EnableClock\n
  *         APBENR2      TIM15EN       LL_APB1_GRP2_EnableClock\n
  *         APBENR2      TIM16EN       LL_APB1_GRP2_EnableClock\n
  *         APBENR2      ADCEN         LL_APB1_GRP2_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC
  *
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APBENR2, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APBENR2, Periphs);
  (void)tmpreg;
}
/**
  * @brief  Check if APB1 GRP2 peripheral clock is enabled or not
  * @rmtoll APBENR2      SYSCFGEN      LL_APB1_GRP2_IsEnabledClock\n
  *         APBENR2      TIM1EN        LL_APB1_GRP2_IsEnabledClock\n
  *         APBENR2      SPI1EN        LL_APB1_GRP2_IsEnabledClock\n
  *         APBENR2      USART1EN      LL_APB1_GRP2_IsEnabledClock\n
  *         APBENR2      TIM15EN       LL_APB1_GRP2_IsEnabledClock\n
  *         APBENR2      TIM16EN       LL_APB1_GRP2_IsEnabledClock\n
  *         APBENR2      ADCEN         LL_APB1_GRP2_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC
  * @note (*) peripheral not available on all devices
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APBENR2, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 GRP2 peripherals clock.
  * @rmtoll APBENR2      SYSCFGEN      LL_APB1_GRP2_DisableClock\n
  *         APBENR2      TIM1EN        LL_APB1_GRP2_DisableClock\n
  *         APBENR2      SPI1EN        LL_APB1_GRP2_DisableClock\n
  *         APBENR2      USART1EN      LL_APB1_GRP2_DisableClock\n
  *         APBENR2      TIM15EN       LL_APB1_GRP2_DisableClock\n
  *         APBENR2      TIM16EN       LL_APB1_GRP2_DisableClock\n
  *         APBENR2      ADCEN         LL_APB1_GRP2_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC
  * @note (*) peripheral not available on all devices
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBENR2, Periphs);
}

/**
  * @brief  Force APB1_GRP2 peripherals reset.
  * @rmtoll APBRSTR2     SYSCFGRST     LL_APB1_GRP2_ForceReset\n
  *         APBRSTR2     TIM1RST       LL_APB1_GRP2_ForceReset\n
  *         APBRSTR2     SPI1RST       LL_APB1_GRP2_ForceReset\n
  *         APBRSTR2     USART1RST     LL_APB1_GRP2_ForceReset\n
  *         APBRSTR2     TIM15RST      LL_APB1_GRP2_ForceReset\n
  *         APBRSTR2     TIM16RST      LL_APB1_GRP2_ForceReset\n
  *         APBRSTR2     ADCRST        LL_APB1_GRP2_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC
  * @note (*) peripheral not available on all devices
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APBRSTR2, Periphs);
}

/**
  * @brief  Release APB1_GRP2 peripherals reset.
  * @rmtoll APBRSTR2     SYSCFGRST     LL_APB1_GRP2_ReleaseReset\n
  *         APBRSTR2     TIM1RST       LL_APB1_GRP2_ReleaseReset\n
  *         APBRSTR2     SPI1RST       LL_APB1_GRP2_ReleaseReset\n
  *         APBRSTR2     USART1RST     LL_APB1_GRP2_ReleaseReset\n
  *         APBRSTR2     TIM15RST      LL_APB1_GRP2_ReleaseReset\n
  *         APBRSTR2     TIM16RST      LL_APB1_GRP2_ReleaseReset\n
  *         APBRSTR2     ADCRST        LL_APB1_GRP2_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_SYSCFG
  *         @arg @ref LL_APB1_GRP2_PERIPH_VREFBUF
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM1
  *         @arg @ref LL_APB1_GRP2_PERIPH_SPI1
  *         @arg @ref LL_APB1_GRP2_PERIPH_USART1
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM15
  *         @arg @ref LL_APB1_GRP2_PERIPH_TIM16
  *         @arg @ref LL_APB1_GRP2_PERIPH_ADC
  * @note (*) peripheral not available on all devices
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP2_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APBRSTR2, Periphs);
}

